[
  {
    "group_standard": [
      {
        "standard": [
          {
            "name": "Leadership",
            "criteria": [
              {
                "name": "The principal has very high expectations for students and teachers.",
                "weightage": 4,
                "subcriteria": [
                  {
                    "name": "The principal ensures that a minimum of 180 instructional days are delivered and can provide documentary evidence."
                  },
                  {
                    "name": "The mandatory number of instructional hours is delivered (Grade 1&2: 3 hours and 36 minutes: Grades 3-12: 4 hours 15 minutes per day)."
                  },
                  {
                    "name": "Corporal punishment is not allowed."
                  },
                  {
                    "name": "Students are responsible and student behavior is very orderly and respectful towards adults and other students."
                  }
                ]
              },

              {
                "name": "The principal has a clear philosophy of education and is an expert in curriculum and instruction. ",
                "weightage": 4,
                "subcriteria": [
                  {
                    "name": "The principal manages a program of teacher collaboration for instructional planning."
                  },
                  {
                    "name": "The principal conducts weekly planning meetings with teachers and staff to develop and review curriculum, syllabi, programs of study, and lesson plans and"
                  },
                  {
                    "name": "The principal ensures that there is continuity and progression among students between grades in the school."
                  },
                  {
                    "name": "The Principal has a written Educational Philosophy posted in his office and all classrooms."
                  }
                ]
              },

              {
                "name": "The principal is involved in a program of continuous professional development and appraisal by supervisors, board members or peers. ",
                "weightage": 6,
                "subcriteria": [
                  {
                    "name": "The principal keeps up to date with innovations in education."
                  },
                  {
                    "name": "The principal creates many opportunities for teachers to engage in continuous professional development activities."
                  },
                  {
                    "name": "The principal mentors teachers and conducts formal and informal training at the school."
                  },
                  {
                    "name": "The principal is evaluated annually by their supervisor/s"
                  }
                ]
              },

              {
                "name": "The principal conducts a regular program of teacher performance appraisals.",
                "weightage": 6,
                "subcriteria": [
                  {
                    "name": "There are regular, structured classroom observation and written reports are produced."
                  },
                  {
                    "name": "Feedback on observations is constructive and designed to improve teaching and learning."
                  },
                  {
                    "name": "The principal coaches teachers and conducts model lessons where necessary."
                  },
                  {
                    "name": "The principal encourages teachers to evaluate their own performance based on student learning outcomes."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },

  {
    "group_standard": [
      {
        "standard": [
          {
            "name": "Teacher Performance",
            "criteria": [
              {
                "name": "All teachers prepare standardized long, medium or short-term lesson plans that provide adequate guidance for teaching and learning activities.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "Plans include appropriate learning activities including differentiated activities for different learners, including those with IEPs."
                  },
                  {
                    "name": "All plans include sequenced, measurable learning objectives from the National and/or State Curricula."
                  },
                  {
                    "name": "Assessment is planned and integrated into lessons and is based on observable and measurable criteria."
                  },
                  {
                    "name": "Student assessment records are used for planning purposes."
                  }
                ]
              },

              {
                "name": "All teachers create high quality classroom learning environments.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "The classrooms and other teaching areas are rich in print and visual displays that are related to the current learning objectives."
                  },
                  {
                    "name": "There are designated areas of the classrooms with topical displays."
                  },
                  {
                    "name": "Book corners or activity centers have appropriate learning materials."
                  },
                  {
                    "name": "A wide range of student work of very high quality is neatly displayed and clearly labeled."
                  }
                ]
              },

              {
                "name": "All teachers manage their time effectively to maximize students’ learning opportunities.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "All lessons start and finish on time."
                  },
                  {
                    "name": "Students are on-task and engaged in learning activities for most of the lesson time."
                  },
                  {
                    "name": "A variety of teaching and learning strategies are used, including strategies suitable for students with IEPs."
                  },
                  {
                    "name": "Student work demonstrates higher-order thinking, inquiry, observation, analysis and problem solving skills."
                  }
                ]
              },

              {
                "name": "All teachers actively participate with enthusiasm in a school-based appraisal program.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "All teachers, individually or in groups, reflect upon and evaluate their performance."
                  },
                  {
                    "name": "All teachers participate in professional development."
                  },
                  {
                    "name": "Teachers regularly make thoughtful and accurate written evaluations of lesson effectiveness based on children’s learning outcomes."
                  },
                  {
                    "name": "All teachers engage in a formal means of peer observation."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },

  {
    "group_standard": [
      {
        "standard": [
          {
            "name": "Data Management",
            "criteria": [
              {
                "name": "Comprehensive and accurate school data is collected on a regular schedule.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "Complete and accurate school data is collected on a quarterly schedule."
                  },
                  {
                    "name": "Daily attendance data for students and teachers is collected and analyzed to produce daily, weekly and annual raw number reports for individuals, classes and the whole school."
                  },
                  {
                    "name": "Reports for the last three years or more are available. "
                  },
                  {
                    "name": "Action is taken early to address attendance and drop-out issues, and no student in the mandatory education range drops out of formal education."
                  }
                ]
              },

              {
                "name": "All school data is centrally located and carefully filed.",
                "weightage": 3,
                "subcriteria": [
                  {
                    "name": "All SDOE-mandated school data files are backed-up or duplicated and are securely held, including IEPs."
                  },
                  {
                    "name": "All data is checked, cleaned and updated at least weekly."
                  },
                  {
                    "name": "Data is provided to the Department of Education by September 15th in either electronic or hardcopy format."
                  },
                  {
                    "name": "All school data is centrally located and accessible."
                  }
                ]
              },

              {
                "name": "All student performance data, including classroom assessment, teacher observations, student portfolios and test data, is analyzed by all teachers to identify individual students’ strengths and weaknesses, including students with IEPs.",
                "weightage": 4,
                "subcriteria": [
                  {
                    "name": "Scheduled assessment meetings are held by teacher teams at least once per quarter."
                  },
                  {
                    "name": "Data analysis is used by teachers to adapt their teaching strategies and programs to meet individual student needs."
                  },
                  {
                    "name": "Teacher observations are used by all teachers to identify students’ strengths and weaknesses, including students with IEPs."
                  },
                  {
                    "name": "Classroom assessment, including student portfolios, are analyzed by all teachers to identify students’ strengths and weaknesses, including students with IEPs."
                  }
                ]
              },

              {
                "name": "An extensive collection of school data is used to guide all management decision making.",
                "weightage": 3,
                "subcriteria": [
                  {
                    "name": "An extensive collection of school data is used to guide all management and resource decision making, with at least two examples given during the Principal Interview of decisions made because of data."
                  },
                  {
                    "name": "A full range of student performance and attendance data, including findings from surveys, is shown and used in the School Improvement Plan."
                  },
                  {
                    "name": "Data analysis is used by the principal to support teacher deployment, with at least two decisions expanded upon during the Principal Interview."
                  },
                  {
                    "name": "Data analysis is used by the principal to support student placement, with at least two decisions expanded upon during the Principal Interview."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },

  {
    "group_standard": [
      {
        "standard": [
          {
            "name": "National Curriculum Standards, Benchmarks and Student Learning Outcomes",
            "criteria": [
              {
                "name": "Written school policy states that English Language Arts, Vernacular Language Arts, Mathematics and Science are taught throughout the school in accordance with the National Curriculum.",
                "weightage": 2,
                "subcriteria": [
                  {
                    "name": "Written school policy states that English Language Arts, Vernacular Language Arts, Mathematics, Social Studies, and Science are taught throughout the school in accordance with the National Curriculum and/or State Curriculum."
                  },
                  {
                    "name": "All lesson plans are based on the National or State Curriculum Standards, Benchmarks and Student Learning Outcomes."
                  },
                  {
                    "name": "Classroom schedules follow the National and/or State adopted Core Classes."
                  },
                  {
                    "name": "All lesson plans include the SDOE-required components."
                  }
                ]
              },

              {
                "name": "Student performance data shows that the vast majority of students reach Competent or Minimum Competent levels on the NMCT and pass other State-mandated exams.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "75% of benchmarks in all tested English Language Arts NMCTs reached the Competent or Minimally Competent category."
                  },
                  {
                    "name": "75% of benchmarks in all tested Mathematics NMCTs reached the Competent or Minimally Competent category."
                  },
                  {
                    "name": "The average student score in all tested Mathematics NMCTs is 75% of questions correct or more."
                  },
                  {
                    "name": "The average student score in all tested English NMCTs is 75% of questions correct or more."
                  }
                ]
              },

              {
                "name": "All students in all grades have their own copies of modern textbooks for Vernacular Language Arts, English Language Arts, Mathematics, Science and Social Studies.",
                "weightage": 5,
                "subcriteria": [
                  {
                    "name": "All students in all grades have their own copies of modern (and/or any) textbooks for Vernacular Language Arts, English Language Arts, Mathematics, Science and Social Studies."
                  },
                  {
                    "name": "All textbooks are aligned to the correct grade level or students are working above grade level and there is clear progression from one grade to the next."
                  },
                  {
                    "name": "Students have access to additional resources, including on-line resources, in a well-stocked library, and/or traditional knowledge for schools."
                  },
                  {
                    "name": "All teachers have a Teacher’s Guide/Teacher’s Edition for all grades and subject areas taught."
                  }
                ]
              },

              {
                "name": "A full timetable of extra-curricular academic, sports, cultural, civic and community activities are conducted after school for both boys and girls.",
                "weightage": 3,
                "subcriteria": [
                  {
                    "name": "At least two extra-curricular academic, sports, conducted after school for both boys and girls."
                  },
                  {
                    "name": "The school informs students of, and promotes cultural, civic and community activities."
                  },
                  {
                    "name": "Students have received awards for extra-curricular activities from local and international bodies and organizations."
                  },
                  {
                    "name": "Values such as fair play and healthy lifestyles are promoted."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }


]
